lisp/clbe/clbe-4.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-02 Thu 20:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Input &amp; Output</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://www.akhanna.net"> HOME </a>
</div><div id="preamble" class="status">
<div id="logo"><a href="https://www.akhanna.net"Ashok Khanna</a></div>
</div>
<div id="content">
<h1 class="title">Input &amp; Output</h1>
<p>
Previous: <a href="clbe-3.html">3. Global Variables &amp; Assignment</a>
</p>

<p>
Next: <a href="clbe-5.html">5. Global Functions</a>
</p>

<p>
The second important side-effect after assignment is input &amp;
output. To write meaningful programs we need to be able to accept user
input and provide output to the user. In this section, we cover the
basic functions to read &amp; print to a screen. Later in the guide we
will cover the useful functions of reading &amp; writing to a file.
</p>

<div id="outline-container-org15f54c8" class="outline-2">
<h2 id="org15f54c8">Lisp Reader</h2>
<div class="outline-text-2" id="text-org15f54c8">
<p>
The READ function takes characters from a stream, interprets them as a
printed representation of a Lisp object, builds a Lisp object and
finally returns it as the value of the function. The collection of
routines that does this is called the (Lisp) reader. There are three
primary variations of the Lisp reader:
</p>

<p>
The function READ is used to parse input into Lisp objects and reads
exactly one expression, regardless of newlines
</p>

<p>
The function READ-LINE reads all characters up to a newline, returning
a string
</p>

<p>
The function READ-FROM-STRING takes a string and returns the first
expression from it
</p>

<p>
Below are some examples you can experiment with.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defparameter</span> <span style="color: #a0522d;">my-variable</span> nil)

(setf my-variable (read-line))

(setf my-variable (read))

(setf my-variable (read-from-string <span style="color: #8b2252;">"(1 2 3)"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-org4d6b534" class="outline-2">
<h2 id="org4d6b534">Lisp Printer</h2>
<div class="outline-text-2" id="text-org4d6b534">
<p>
Functions such as PRINT take a Lisp object and send the
characters of its printed representation to a stream. The collection
of routines that does this is known as the (Lisp) printer. PRIN1 and
PRINT are used to generate output useful for programs (the latter adds
a newline to the output whilst the former does not). PRINC is used for
output for people. TERPRI prints a newline.  The FORMAT function is
the most commonly used printer in Lisp. Its syntax is as follows.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
(format destination control-string optional-arguments*)

</pre>
</div>

<p>
The first argument of the FORMAT function is the destination where the
output will be printed. A value of T will send the out to the stream
*​standard-output​* (typically the main screen of your Lisp system)
whilst NIL here will return the output as a string. We can
alternatively supply a stream pointing to a file in our file system,
and this is how we use FORMAT to write to files (we will discuss this
later in this guide).
</p>

<p>
The second argument of the FORMAT function is the string that we want
to print. However, we can enter directives (preceded by ~) to add
complex behaviour to the string, such as printing newlines (~%)
(i.e. TERPRI) or for inserting the printed representation of Lisp
objects into the string (~A to print as PRINC, i.e. output for people
and ~S to print as PRIN1, i.e. output suitable as input for the READ
function).
</p>

<p>
The third (optional) argument of the FORMAT function is the arguments
we want to supply to the control string. Each ~A or ~S in the
control-string takes a successive argument from here and places it
into the string.
</p>

<p>
This is best illustrated by the following examples. Note how Bob is
quoted in the second example as the printed representation of Lisp
strings includes quotes.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Prints to screen: Dear Bob, How are you?</span>

(format t <span style="color: #8b2252;">"Dear ~A, ~% How are you?"</span> <span style="color: #8b2252;">"Bob"</span>)


<span style="color: #b22222;">;; </span><span style="color: #b22222;">Prints to screen: Dear "Bob", How are you?</span>

(format t <span style="color: #8b2252;">"Dear ~S, How are you?"</span> <span style="color: #8b2252;">"Bob"</span>)


<span style="color: #b22222;">;; </span><span style="color: #b22222;">Returns "Number is: 3" (a string)</span>

(format nil <span style="color: #8b2252;">"~A ~A"</span> <span style="color: #8b2252;">"Number is:"</span> (+ 1 2))

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 24 July 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
